# Cable Size Number Of Ground Conductors Property

Source: https://www.revitapidocs.com/2026/ff6836f3-6f4f-ec8f-7d5e-d2da45d1fa1f.htm

---

| Cable Size Number Of Ground Conductors Property |
| --- |

The number of Ground Conductors.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int NumberOfGroundConductors { get; set; }
```

```
Public Property NumberOfGroundConductors As Integer
	Get
	Set
```

```
public:
property int NumberOfGroundConductors {
	int get ();
	void set (int value);
}
```

```
member NumberOfGroundConductors : int with get, set
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for numberOfGroundConductors is negative. |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace